using System;
using System.Collections.Generic;
using System.Configuration;
using System.Data;
using System.Linq;
using System.Threading.Tasks;
using System.Windows;

/*
Свиргстина Александра

Задание:
Изменить WPF-приложение для ведения списка сотрудников компании (из урока №5), используя связывание данных, DataGrid и ADO.NET.
1. Создать таблицы Employee и Department в БД MSSQL Server и заполнить списки сущностей начальными данными.
2. Для списка сотрудников и списка департаментов предусмотреть визуализацию (отображение). Это можно сделать, например, с использованием ComboBox или ListView.
3. Предусмотреть возможность редактирования сотрудников и департаментов. Должна быть возможность изменить департамент у сотрудника. Список департаментов для выбора, можно выводить в ComboBox, это все можно выводить на дополнительной форме.
4. Предусмотреть возможность создания новых сотрудников и департаментов. Реализовать данную возможность либо на форме редактирования, либо сделать новую форму.
 */

namespace App_CompanyEmployees
{
    /// <summary>
    /// Логика взаимодействия для App.xaml
    /// </summary>
    public partial class App : Application
    {

    }

}
